{
  "version": "1.0",
  "truncation": null,
  "padding": null,
  "added_tokens": [
    {
      "id": 0,
      "content": "<s>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 1,
      "content": "</s>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 2,
      "content": "<unk>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 3,
      "content": "[INST]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 4,
      "content": "[/INST]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    }
  ],
  "normalizer": {
    "type": "NFKC"
  },
  "pre_tokenizer": {
    "type": "ByteLevel",
    "add_prefix_space": false,
    "trim_offsets": true,
    "use_regex": true
  },
  "post_processor": null,
  "decoder": null,
  "model": {
    "type": "BPE",
    "dropout": null,
    "unk_token": null,
    "continuing_subword_prefix": null,
    "end_of_word_suffix": null,
    "fuse_unk": false,
    "byte_fallback": false,
    "ignore_merges": false,
    "vocab": {
      "<s>": 0,
      "</s>": 1,
      "<unk>": 2,
      "[INST]": 3,
      "[/INST]": 4,
      "!": 5,
      "\"": 6,
      "#": 7,
      "$": 8,
      "%": 9,
      "&": 10,
      "'": 11,
      "(": 12,
      ")": 13,
      "*": 14,
      "+": 15,
      ",": 16,
      "-": 17,
      ".": 18,
      "/": 19,
      "0": 20,
      "1": 21,
      "2": 22,
      "3": 23,
      "4": 24,
      "5": 25,
      "6": 26,
      "7": 27,
      "8": 28,
      "9": 29,
      ":": 30,
      ";": 31,
      "<": 32,
      "=": 33,
      ">": 34,
      "?": 35,
      "@": 36,
      "A": 37,
      "B": 38,
      "C": 39,
      "D": 40,
      "E": 41,
      "F": 42,
      "G": 43,
      "H": 44,
      "I": 45,
      "J": 46,
      "K": 47,
      "L": 48,
      "M": 49,
      "N": 50,
      "O": 51,
      "P": 52,
      "Q": 53,
      "R": 54,
      "S": 55,
      "T": 56,
      "U": 57,
      "V": 58,
      "W": 59,
      "X": 60,
      "Y": 61,
      "Z": 62,
      "[": 63,
      "\\": 64,
      "]": 65,
      "^": 66,
      "_": 67,
      "`": 68,
      "a": 69,
      "b": 70,
      "c": 71,
      "d": 72,
      "e": 73,
      "f": 74,
      "g": 75,
      "h": 76,
      "i": 77,
      "j": 78,
      "k": 79,
      "l": 80,
      "m": 81,
      "n": 82,
      "o": 83,
      "p": 84,
      "q": 85,
      "r": 86,
      "s": 87,
      "t": 88,
      "u": 89,
      "v": 90,
      "w": 91,
      "x": 92,
      "y": 93,
      "z": 94,
      "{": 95,
      "|": 96,
      "}": 97,
      "~": 98,
      "¡": 99,
      "¢": 100,
      "£": 101,
      "¤": 102,
      "¥": 103,
      "¦": 104,
      "§": 105,
      "¨": 106,
      "©": 107,
      "ª": 108,
      "«": 109,
      "¬": 110,
      "®": 111,
      "¯": 112,
      "°": 113,
      "±": 114,
      "²": 115,
      "³": 116,
      "´": 117,
      "µ": 118,
      "¶": 119,
      "·": 120,
      "¸": 121,
      "¹": 122,
      "º": 123,
      "»": 124,
      "¼": 125,
      "½": 126,
      "¾": 127,
      "¿": 128,
      "À": 129,
      "Á": 130,
      "Â": 131,
      "Ã": 132,
      "Ä": 133,
      "Å": 134,
      "Æ": 135,
      "Ç": 136,
      "È": 137,
      "É": 138,
      "Ê": 139,
      "Ë": 140,
      "Ì": 141,
      "Í": 142,
      "Î": 143,
      "Ï": 144,
      "Ð": 145,
      "Ñ": 146,
      "Ò": 147,
      "Ó": 148,
      "Ô": 149,
      "Õ": 150,
      "Ö": 151,
      "×": 152,
      "Ø": 153,
      "Ù": 154,
      "Ú": 155,
      "Û": 156,
      "Ü": 157,
      "Ý": 158,
      "Þ": 159,
      "ß": 160,
      "à": 161,
      "á": 162,
      "â": 163,
      "ã": 164,
      "ä": 165,
      "å": 166,
      "æ": 167,
      "ç": 168,
      "è": 169,
      "é": 170,
      "ê": 171,
      "ë": 172,
      "ì": 173,
      "í": 174,
      "î": 175,
      "ï": 176,
      "ð": 177,
      "ñ": 178,
      "ò": 179,
      "ó": 180,
      "ô": 181,
      "õ": 182,
      "ö": 183,
      "÷": 184,
      "ø": 185,
      "ù": 186,
      "ú": 187,
      "û": 188,
      "ü": 189,
      "ý": 190,
      "þ": 191,
      "ÿ": 192,
      "Ā": 193,
      "ā": 194,
      "Ă": 195,
      "ă": 196,
      "Ą": 197,
      "ą": 198,
      "Ć": 199,
      "ć": 200,
      "Ĉ": 201,
      "ĉ": 202,
      "Ċ": 203,
      "ċ": 204,
      "Č": 205,
      "č": 206,
      "Ď": 207,
      "ď": 208,
      "Đ": 209,
      "đ": 210,
      "Ē": 211,
      "ē": 212,
      "Ĕ": 213,
      "ĕ": 214,
      "Ė": 215,
      "ė": 216,
      "Ę": 217,
      "ę": 218,
      "Ě": 219,
      "ě": 220,
      "Ĝ": 221,
      "ĝ": 222,
      "Ğ": 223,
      "ğ": 224,
      "Ġ": 225,
      "ġ": 226,
      "Ģ": 227,
      "ģ": 228,
      "Ĥ": 229,
      "ĥ": 230,
      "Ħ": 231,
      "ħ": 232,
      "Ĩ": 233,
      "ĩ": 234,
      "Ī": 235,
      "ī": 236,
      "Ĭ": 237,
      "ĭ": 238,
      "Į": 239,
      "į": 240,
      "İ": 241,
      "ı": 242,
      "Ĳ": 243,
      "ĳ": 244,
      "Ĵ": 245,
      "ĵ": 246,
      "Ķ": 247,
      "ķ": 248,
      "ĸ": 249,
      "Ĺ": 250,
      "ĺ": 251,
      "Ļ": 252,
      "ļ": 253,
      "Ľ": 254,
      "ľ": 255,
      "Ŀ": 256,
      "ŀ": 257,
      "Ł": 258,
      "ł": 259,
      "Ń": 260,
      "in": 261,
      "Ġt": 262,
      "ar": 263,
      "le": 264,
      "is": 265,
      "ing": 266,
      "IN": 267,
      "ST": 268,
      "am": 269,
      "de": 270,
      "he": 271,
      "Ġ[": 272,
      "Ġa": 273,
      "Ġs": 274,
      "Ġis": 275,
      "INST": 276,
      "al": 277,
      "co": 278,
      "en": 279,
      "er": 280,
      "ex": 281,
      "ial": 282,
      "ning": 283,
      "ple": 284,
      "Ġ<": 285,
      "Ġl": 286,
      "Ġin": 287,
      "Ġle": 288,
      "Ġto": 289,
      "arning": 290,
      "ample": 291,
      "Ġlearning": 292,
      "()": 293,
      "ac": 294,
      "an": 295,
      "at": 296,
      "cial": 297,
      "fo": 298,
      "gr": 299,
      "hin": 300,
      "iz": 301,
      "ken": 302,
      "ll": 303,
      "ming": 304,
      "pr": 305,
      "Ġm": 306,
      "Ġo": 307,
      "Ġar": 308,
      "Ġpr": 309,
      "Ġthe": 310,
      "Ġ[/": 311,
      "com": 312,
      "example": 313,
      "Ġtoken": 314,
      "achin": 315,
      "achine": 316,
      "ĠT": 317,
      "!@": 318,
      "#$": 319,
      "%^": 320,
      "&*": 321,
      "')": 322,
      "'s": 323,
      "('": 324,
      "//": 325,
      "12": 326,
      "34": 327,
      "56": 328,
      "78": 329,
      "90": 330,
      "://": 331,
      "AI": 332,
      "De": 333,
      "Her": 334,
      "It": 335,
      "Machine": 336,
      "Py": 337,
      "Wh": 338,
      "ab": 339,
      "ag": 340,
      "ai": 341,
      "az": 342,
      "br": 343,
      "bs": 344,
      "ce": 345,
      "ck": 346,
      "cl": 347,
      "cab": 348,
      "do": 349,
      "em": 350,
      "ep": 351,
      "et": 352,
      "eat": 353,
      "ecial": 354,
      "ell": 355,
      "fi": 356,
      "gu": 357,
      "gen": 358,
      "ho": 359,
      "ht": 360,
      "his": 361,
      "ik": 362,
      "it": 363,
      "ick": 364,
      "ifi": 365,
      "igen": 366,
      "ju": 367,
      "ld": 368,
      "ls": 369,
      "lar": 370,
      "me": 371,
      "mp": 372,
      "nd": 373,
      "nk": 374,
      "or": 375,
      "ow": 376,
      "ode": 377,
      "ogr": 378,
      "ocab": 379,
      "ome": 380,
      "pecial": 381,
      "qu": 382,
      "ran": 383,
      "rming": 384,
      "sfo": 385,
      "tp": 386,
      "tell": 387,
      "tho": 388,
      "tifi": 389,
      "ude": 390,
      "ubs": 391,
      "ular": 392,
      "unk": 393,
      "ver": 394,
      "vocab": 395,
      "wor": 396,
      "Ġde": 397,
      "Ġhe": 398,
      "Ġco": 399,
      "Ġfo": 400,
      "Ġgr": 401,
      "Ġ12": 402,
      "ĠAI": 403,
      "ĠDe": 404,
      "ĠHer": 405,
      "ĠIt": 406,
      "ĠMachine": 407,
      "ĠPy": 408,
      "ĠWh": 409,
      "Ġbr": 410,
      "Ġdo": 411,
      "Ġem": 412,
      "Ġht": 413,
      "Ġju": 414,
      "Ġqu": 415,
      "Ġvocab": 416,
      "int": 417,
      "Ġtex": 418,
      "Ġtran": 419,
      "amming": 420,
      "Ġand": 421,
      "Ġsample": 422,
      "Ġsome": 423,
      "Ġspecial": 424,
      "Ġsubs": 425,
      "ializ": 426,
      "Ġ</": 427,
      "Ġlan": 428,
      "Ġlaz": 429,
      "Ġlik": 430,
      "Ġincl": 431,
      "Ġinit": 432,
      "Ġintell": 433,
      "():": 434,
      "izer": 435,
      "llo": 436,
      "Ġmachine": 437,
      "Ġmode": 438,
      "Ġof": 439,
      "Ġover": 440,
      "Ġare": 441,
      "Ġartifi": 442,
      "Ġprogr": 443,
      "Ġprint": 444,
      "Ġtokens": 445,
      "Ġtokenizer": 446,
      "ĠThe": 447,
      "!@#$": 448,
      "%^&*": 449,
      "3456": 450,
      "7890": 451,
      "age": 452,
      "ail": 453,
      "guage": 454,
      "igence": 455,
      "mps": 456,
      "own": 457,
      "sforming": 458,
      "thon": 459,
      "udes": 460,
      "ulary": 461,
      "world": 462,
      "Ġdef": 463,
      "Ġhello": 464,
      "Ġcode": 465,
      "Ġfox": 466,
      "Ġgreat": 467,
      "Ġ123456": 468,
      "ĠDeep": 469,
      "ĠHere": 470,
      "ĠPython": 471,
      "ĠWhat": 472,
      "Ġbrown": 473,
      "Ġdog": 474,
      "Ġemail": 475,
      "Ġhttp": 476,
      "Ġjumps": 477,
      "Ġquick": 478,
      "Ġvocabulary": 479,
      "Ġtext": 480,
      "Ġtransforming": 481,
      "Ġsubset": 482,
      "ialize": 483,
      "Ġlanguage": 484,
      "Ġlazy": 485,
      "Ġlike": 486,
      "Ġincludes": 487,
      "Ġinitialize": 488,
      "Ġintelligence": 489,
      "Ġmodels": 490,
      "Ġartificial": 491,
      "Ġprogramming": 492,
      "!@#$%^&*": 493,
      "Ġ1234567890": 494,
      "!@#$%^&*()": 495,
      "This": 496,
      "ĠThis": 497
    },
    "merges": [
      [
        "i",
        "n"
      ],
      [
        "Ġ",
        "t"
      ],
      [
        "a",
        "r"
      ],
      [
        "l",
        "e"
      ],
      [
        "i",
        "s"
      ],
      [
        "in",
        "g"
      ],
      [
        "I",
        "N"
      ],
      [
        "S",
        "T"
      ],
      [
        "a",
        "m"
      ],
      [
        "d",
        "e"
      ],
      [
        "h",
        "e"
      ],
      [
        "Ġ",
        "["
      ],
      [
        "Ġ",
        "a"
      ],
      [
        "Ġ",
        "s"
      ],
      [
        "Ġ",
        "is"
      ],
      [
        "IN",
        "ST"
      ],
      [
        "a",
        "l"
      ],
      [
        "c",
        "o"
      ],
      [
        "e",
        "n"
      ],
      [
        "e",
        "r"
      ],
      [
        "e",
        "x"
      ],
      [
        "i",
        "al"
      ],
      [
        "n",
        "ing"
      ],
      [
        "p",
        "le"
      ],
      [
        "Ġ",
        "<"
      ],
      [
        "Ġ",
        "l"
      ],
      [
        "Ġ",
        "in"
      ],
      [
        "Ġ",
        "le"
      ],
      [
        "Ġt",
        "o"
      ],
      [
        "ar",
        "ning"
      ],
      [
        "am",
        "ple"
      ],
      [
        "Ġle",
        "arning"
      ],
      [
        "(",
        ")"
      ],
      [
        "a",
        "c"
      ],
      [
        "a",
        "n"
      ],
      [
        "a",
        "t"
      ],
      [
        "c",
        "ial"
      ],
      [
        "f",
        "o"
      ],
      [
        "g",
        "r"
      ],
      [
        "h",
        "in"
      ],
      [
        "i",
        "z"
      ],
      [
        "k",
        "en"
      ],
      [
        "l",
        "l"
      ],
      [
        "m",
        "ing"
      ],
      [
        "p",
        "r"
      ],
      [
        "Ġ",
        "m"
      ],
      [
        "Ġ",
        "o"
      ],
      [
        "Ġ",
        "ar"
      ],
      [
        "Ġ",
        "pr"
      ],
      [
        "Ġt",
        "he"
      ],
      [
        "Ġ[",
        "/"
      ],
      [
        "co",
        "m"
      ],
      [
        "ex",
        "ample"
      ],
      [
        "Ġto",
        "ken"
      ],
      [
        "ac",
        "hin"
      ],
      [
        "achin",
        "e"
      ],
      [
        "Ġ",
        "T"
      ],
      [
        "!",
        "@"
      ],
      [
        "#",
        "$"
      ],
      [
        "%",
        "^"
      ],
      [
        "&",
        "*"
      ],
      [
        "'",
        ")"
      ],
      [
        "'",
        "s"
      ],
      [
        "(",
        "'"
      ],
      [
        "/",
        "/"
      ],
      [
        "1",
        "2"
      ],
      [
        "3",
        "4"
      ],
      [
        "5",
        "6"
      ],
      [
        "7",
        "8"
      ],
      [
        "9",
        "0"
      ],
      [
        ":",
        "//"
      ],
      [
        "A",
        "I"
      ],
      [
        "D",
        "e"
      ],
      [
        "H",
        "er"
      ],
      [
        "I",
        "t"
      ],
      [
        "M",
        "achine"
      ],
      [
        "P",
        "y"
      ],
      [
        "W",
        "h"
      ],
      [
        "a",
        "b"
      ],
      [
        "a",
        "g"
      ],
      [
        "a",
        "i"
      ],
      [
        "a",
        "z"
      ],
      [
        "b",
        "r"
      ],
      [
        "b",
        "s"
      ],
      [
        "c",
        "e"
      ],
      [
        "c",
        "k"
      ],
      [
        "c",
        "l"
      ],
      [
        "c",
        "ab"
      ],
      [
        "d",
        "o"
      ],
      [
        "e",
        "m"
      ],
      [
        "e",
        "p"
      ],
      [
        "e",
        "t"
      ],
      [
        "e",
        "at"
      ],
      [
        "e",
        "cial"
      ],
      [
        "e",
        "ll"
      ],
      [
        "f",
        "i"
      ],
      [
        "g",
        "u"
      ],
      [
        "g",
        "en"
      ],
      [
        "h",
        "o"
      ],
      [
        "h",
        "t"
      ],
      [
        "h",
        "is"
      ],
      [
        "i",
        "k"
      ],
      [
        "i",
        "t"
      ],
      [
        "i",
        "ck"
      ],
      [
        "i",
        "fi"
      ],
      [
        "i",
        "gen"
      ],
      [
        "j",
        "u"
      ],
      [
        "l",
        "d"
      ],
      [
        "l",
        "s"
      ],
      [
        "l",
        "ar"
      ],
      [
        "m",
        "e"
      ],
      [
        "m",
        "p"
      ],
      [
        "n",
        "d"
      ],
      [
        "n",
        "k"
      ],
      [
        "o",
        "r"
      ],
      [
        "o",
        "w"
      ],
      [
        "o",
        "de"
      ],
      [
        "o",
        "gr"
      ],
      [
        "o",
        "cab"
      ],
      [
        "o",
        "me"
      ],
      [
        "p",
        "ecial"
      ],
      [
        "q",
        "u"
      ],
      [
        "r",
        "an"
      ],
      [
        "r",
        "ming"
      ],
      [
        "s",
        "fo"
      ],
      [
        "t",
        "p"
      ],
      [
        "t",
        "ell"
      ],
      [
        "t",
        "ho"
      ],
      [
        "t",
        "ifi"
      ],
      [
        "u",
        "de"
      ],
      [
        "u",
        "bs"
      ],
      [
        "u",
        "lar"
      ],
      [
        "u",
        "nk"
      ],
      [
        "v",
        "er"
      ],
      [
        "v",
        "ocab"
      ],
      [
        "w",
        "or"
      ],
      [
        "Ġ",
        "de"
      ],
      [
        "Ġ",
        "he"
      ],
      [
        "Ġ",
        "co"
      ],
      [
        "Ġ",
        "fo"
      ],
      [
        "Ġ",
        "gr"
      ],
      [
        "Ġ",
        "12"
      ],
      [
        "Ġ",
        "AI"
      ],
      [
        "Ġ",
        "De"
      ],
      [
        "Ġ",
        "Her"
      ],
      [
        "Ġ",
        "It"
      ],
      [
        "Ġ",
        "Machine"
      ],
      [
        "Ġ",
        "Py"
      ],
      [
        "Ġ",
        "Wh"
      ],
      [
        "Ġ",
        "br"
      ],
      [
        "Ġ",
        "do"
      ],
      [
        "Ġ",
        "em"
      ],
      [
        "Ġ",
        "ht"
      ],
      [
        "Ġ",
        "ju"
      ],
      [
        "Ġ",
        "qu"
      ],
      [
        "Ġ",
        "vocab"
      ],
      [
        "in",
        "t"
      ],
      [
        "Ġt",
        "ex"
      ],
      [
        "Ġt",
        "ran"
      ],
      [
        "am",
        "ming"
      ],
      [
        "Ġa",
        "nd"
      ],
      [
        "Ġs",
        "ample"
      ],
      [
        "Ġs",
        "ome"
      ],
      [
        "Ġs",
        "pecial"
      ],
      [
        "Ġs",
        "ubs"
      ],
      [
        "ial",
        "iz"
      ],
      [
        "Ġ<",
        "/"
      ],
      [
        "Ġl",
        "an"
      ],
      [
        "Ġl",
        "az"
      ],
      [
        "Ġl",
        "ik"
      ],
      [
        "Ġin",
        "cl"
      ],
      [
        "Ġin",
        "it"
      ],
      [
        "Ġin",
        "tell"
      ],
      [
        "()",
        ":"
      ],
      [
        "iz",
        "er"
      ],
      [
        "ll",
        "o"
      ],
      [
        "Ġm",
        "achine"
      ],
      [
        "Ġm",
        "ode"
      ],
      [
        "Ġo",
        "f"
      ],
      [
        "Ġo",
        "ver"
      ],
      [
        "Ġar",
        "e"
      ],
      [
        "Ġar",
        "tifi"
      ],
      [
        "Ġpr",
        "ogr"
      ],
      [
        "Ġpr",
        "int"
      ],
      [
        "Ġtoken",
        "s"
      ],
      [
        "Ġtoken",
        "izer"
      ],
      [
        "ĠT",
        "he"
      ],
      [
        "!@",
        "#$"
      ],
      [
        "%^",
        "&*"
      ],
      [
        "34",
        "56"
      ],
      [
        "78",
        "90"
      ],
      [
        "ag",
        "e"
      ],
      [
        "ai",
        "l"
      ],
      [
        "gu",
        "age"
      ],
      [
        "igen",
        "ce"
      ],
      [
        "mp",
        "s"
      ],
      [
        "ow",
        "n"
      ],
      [
        "sfo",
        "rming"
      ],
      [
        "tho",
        "n"
      ],
      [
        "ude",
        "s"
      ],
      [
        "ular",
        "y"
      ],
      [
        "wor",
        "ld"
      ],
      [
        "Ġde",
        "f"
      ],
      [
        "Ġhe",
        "llo"
      ],
      [
        "Ġco",
        "de"
      ],
      [
        "Ġfo",
        "x"
      ],
      [
        "Ġgr",
        "eat"
      ],
      [
        "Ġ12",
        "3456"
      ],
      [
        "ĠDe",
        "ep"
      ],
      [
        "ĠHer",
        "e"
      ],
      [
        "ĠPy",
        "thon"
      ],
      [
        "ĠWh",
        "at"
      ],
      [
        "Ġbr",
        "own"
      ],
      [
        "Ġdo",
        "g"
      ],
      [
        "Ġem",
        "ail"
      ],
      [
        "Ġht",
        "tp"
      ],
      [
        "Ġju",
        "mps"
      ],
      [
        "Ġqu",
        "ick"
      ],
      [
        "Ġvocab",
        "ulary"
      ],
      [
        "Ġtex",
        "t"
      ],
      [
        "Ġtran",
        "sforming"
      ],
      [
        "Ġsubs",
        "et"
      ],
      [
        "ializ",
        "e"
      ],
      [
        "Ġlan",
        "guage"
      ],
      [
        "Ġlaz",
        "y"
      ],
      [
        "Ġlik",
        "e"
      ],
      [
        "Ġincl",
        "udes"
      ],
      [
        "Ġinit",
        "ialize"
      ],
      [
        "Ġintell",
        "igence"
      ],
      [
        "Ġmode",
        "ls"
      ],
      [
        "Ġartifi",
        "cial"
      ],
      [
        "Ġprogr",
        "amming"
      ],
      [
        "!@#$",
        "%^&*"
      ],
      [
        "Ġ123456",
        "7890"
      ],
      [
        "!@#$%^&*",
        "()"
      ],
      [
        "T",
        "his"
      ],
      [
        "ĠT",
        "his"
      ]
    ]
  }
}